// ‘ункци€ дл€ формировани€ строки во множественной форме на русском €зыке
export default function ruPluralize(number, strings) {
    // ѕровер€ем, есть ли у нас четыре формы (0, 1, 2-4, множественна€)
    if (strings.length === 4) {
        // ≈сли число равно 0, возвращаем форму дл€ нул€
        if (number === 0) {
            return strings[0];
        }

        // ”дал€ем первый элемент (форму дл€ 0), так как она нам больше не нужна
        strings.shift();
    }

    // ѕриводим число к диапазону от 0 до 99
    number = number % 100;

    // ≈сли число больше 20, приводим его к диапазону от 0 до 9
    if (number > 20) {
        number = number % 10;
    }

    // ≈сли число равно 1, возвращаем форму дл€ единственного числа
    if (number === 1) {
        return strings[0];
    }

    // ≈сли число больше 1 и меньше 5, возвращаем форму дл€ 2-4
    if (number > 1 && number < 5) {
        return strings[1];
    }

    // ¬озвращаем форму дл€ множественного числа (5 и более)
    return strings[2];
}
